chooyeonung/obd2-web-diagnostics/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1 N8R8 기준 기본 설정 (DevKitC-1-N8R8)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# 커스텀 파티션 (LittleFS 정적 파일 영역 포함)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTP 서버의 WebSocket 지원 (필수)
CONFIG_HTTPD_WS_SUPPORT=y

# 로그
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
